---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.GetBasicIEnumerator
source: html/1ac62d1b-f9cd-39c4-cc04-1527c315e4a8.htm
---
# Autodesk.Revit.DB.ExportPatternTable.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.